{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"lstm_4_input": {"name": "lstm_4_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "19"}, {"size": "1"}]}}}, "outputs": {"dense_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "lstm_4_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "19"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Shape", "op": "Shape", "input": ["lstm_4_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose", "op": "Transpose", "input": ["lstm_4_input", "StatefulPartitionedCall/sequential_2/lstm_4/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Shape", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/transpose", "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Shape_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed", "StatefulPartitionedCall/sequential_2/lstm_4/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2/lstm_4/zeros_1", "^StatefulPartitionedCall/sequential_2/lstm_4/zeros", "^StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor"]}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros_1", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/time", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_23", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_2/lstm_4/while/LoopControlInputs/_26"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNC93aGlsZQ=="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_18", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_57"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_20", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_21", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_15", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_54"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_16", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_55"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_19", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_22", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_61"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_17", "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_56"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/cond/_13/sequential_2/lstm_4/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_29", "StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_33", "^StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_34", "^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_23", "^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_24", "^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_25", "^StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_27", "^StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_28", "^StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_30", "^StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_31", "^StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_32"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/cond/_13/sequential_2/lstm_4/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_33", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_27", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_28", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_1_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_32", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_34", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/time_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_29", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_31", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/merge/_30", "StatefulPartitionedCall/sequential_2/lstm_4/while/LoopCond/_35"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1_switch/_42"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter_switch/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/loop_body_control/_44", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter_switch/_36:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations_switch/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_1_switch/_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor_switch/_43"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/time_switch/_38"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_switch/_40"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1_switch/_39"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor_switch/_43", "^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1_switch/_39", "^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1_switch/_42", "^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/time_switch/_38", "^StatefulPartitionedCall/sequential_2/lstm_4/while/loop_body_control/_44", "^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations_switch/_37", "^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_1_switch/_41", "^StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_switch/_40", "^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_23", "^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_24", "^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_25"]}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/exit/_48", "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input/_127", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/time_switch/_38:1", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_23", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_24", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/while/enter/_25", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_4/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter_switch/_36:1", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input/_127", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor_switch/_43:1", "Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input/_127", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/zeros_switch/_40:1", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/output_control_node/_147", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Shape_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_60", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1_switch/_42:1", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/output_control_node/_147", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_61", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor_switch/_43:1", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/output_control_node/_147", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add_1", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/output_control_node/_147", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations_switch/_37:1", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/output_control_node/_147", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/NoOp", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/input_control_node/_124"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/add", "^Func/StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/output_control_node/_147", "^StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Shape", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/add", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed", "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed", "StatefulPartitionedCall/sequential_2/lstm_5/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split/split_dim", "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2/lstm_5/zeros_1", "^StatefulPartitionedCall/sequential_2/lstm_5/zeros", "^StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor"]}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/body/_14/sequential_2/lstm_4/while/lstm_cell_4/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_65", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/while/maximum_iterations", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_69", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/zeros_1", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_67", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_70", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_64", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/while/loop_counter", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_68", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/zeros", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_71", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/time", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_72", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_73", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2xzdG1fNS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/enter/_74", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_6", "^StatefulPartitionedCall/sequential_2/lstm_5/while/LoopControlInputs/_75"], "attr": {"T": {"type": "DT_FLOAT"},