{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"lstm_4_input": {"name": "lstm_4_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "18"}, {"size": "1"}]}}}, "outputs": {"dense_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_4_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "18"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Shape", "op": "Shape", "input": ["lstm_4_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose", "op": "Transpose", "input": ["lstm_4_input", "StatefulPartitionedCall/sequential_2/lstm_4/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Shape", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/transpose", "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/Shape_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros/packed", "StatefulPartitionedCall/sequential_2/lstm_4/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/packed", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while/loop_counter", "StatefulPartitionedCall/sequential_2/lstm_4/while/maximum_iterations", "StatefulPartitionedCall/sequential_2/lstm_4/time", "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2_1", "StatefulPartitionedCall/sequential_2/lstm_4/zeros", "StatefulPartitionedCall/sequential_2/lstm_4/zeros_1", "StatefulPartitionedCall/sequential_2/lstm_4/strided_slice_1", "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "1"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "cond": {"func": {"name": "__inference_sequential_2_lstm_4_while_cond_86879_frozen_4395"}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394"}}, "_stateful_parallelism": {"b": false}, "parallel_iterations": {"i": "32"}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/while:3", "StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_4/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_4/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/lstm_4/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Shape_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/Shape", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/strided_slice", "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/zeros/packed", "StatefulPartitionedCall/sequential_2/lstm_5/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/packed", "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/while/loop_counter", "StatefulPartitionedCall/sequential_2/lstm_5/while/maximum_iterations", "StatefulPartitionedCall/sequential_2/lstm_5/time", "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2_1", "StatefulPartitionedCall/sequential_2/lstm_5/zeros", "StatefulPartitionedCall/sequential_2/lstm_5/zeros_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_1", "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"cond": {"func": {"name": "__inference_sequential_2_lstm_5_while_cond_87019_frozen_4393"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392"}}, "parallel_iterations": {"i": "32"}, "_stateful_parallelism": {"b": false}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/while:3", "StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/lstm_5/strided_slice_3", "StatefulPartitionedCall/sequential_2/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_4/Relu", "StatefulPartitionedCall/sequential_2/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_5/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_2/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_5/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_2_lstm_4_while_cond_86879_frozen_4395", "inputArg": [{"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_4_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_less_sequential_2_lstm_4_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_cond_86879___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_cond_86879___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_cond_86879___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_cond_86879___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_2_lstm_4_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_2/lstm_4/while/Less", "op": "Less", "input": ["sequential_2_lstm_4_while_placeholder", "sequential_2_lstm_4_while_less_sequential_2_lstm_4_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_2_lstm_4_while_identity": "sequential_2/lstm_4/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}}}, {"signature": {"name": "__inference_sequential_2_lstm_5_while_cond_87019_frozen_4393", "inputArg": [{"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_5_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_less_sequential_2_lstm_5_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_cond_87019___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_cond_87019___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_cond_87019___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_cond_87019___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_2_lstm_5_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_2/lstm_5/while/Less", "op": "Less", "input": ["sequential_2_lstm_5_while_placeholder", "sequential_2_lstm_5_while_less_sequential_2_lstm_5_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_2_lstm_5_while_identity": "sequential_2/lstm_5/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394", "inputArg": [{"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_4_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_strided_slice_1_0", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_4_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_4_while_lstm_cell_4_matmul_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_lstm_cell_4_matmul_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_lstm_cell_4_biasadd_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_2_lstm_4_while_identity", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_4_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_sequential_2_lstm_4_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_2_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_4_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_4_while_lstm_cell_4_matmul_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_lstm_cell_4_matmul_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_4_while_lstm_cell_4_biasadd_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/lstm_cell_4/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "op": "Identity", "input": ["sequential_2_lstm_4_while_lstm_cell_4_matmul_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp", "op": "Identity", "input": ["sequential_2_lstm_4_while_lstm_cell_4_matmul_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_2_lstm_4_while_lstm_cell_4_biasadd_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/add", "op": "AddV2", "input": ["sequential_2_lstm_4_while_placeholder", "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_2_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_4_tensorarrayunstack_tensorlistfromtensor_0", "sequential_2_lstm_4_while_placeholder", "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/add_1", "op": "AddV2", "input": ["sequential_2_lstm_4_while_sequential_2_lstm_4_while_loop_counter", "__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1", "op": "MatMul", "input": ["sequential_2_lstm_4_while_placeholder_2", "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp:output:0"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/NoOp", "op": "NoOp", "input": ["^sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "^sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "^sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/MatMul", "op": "MatMul", "input": ["sequential_2/lstm_4/while/TensorArrayV2Read/TensorListGetItem:item:0", "sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp:output:0"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/Identity_1", "op": "Identity", "input": ["sequential_2_lstm_4_while_sequential_2_lstm_4_while_maximum_iterations", "^sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_4/while/Identity_2", "op": "Identity", "input": ["sequential_2/lstm_4/while/add:z:0", "^sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_4/while/Identity", "op": "Identity", "input": ["sequential_2/lstm_4/while/add_1:z:0", "^sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/add", "op": "AddV2", "input": ["sequential_2/lstm_4/while/lstm_cell_4/MatMul:product:0", "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/BiasAdd", "op": "BiasAdd", "input": ["sequential_2/lstm_4/while/lstm_cell_4/add:z:0", "sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp:output:0"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/split", "op": "Split", "input": ["__inference_sequential_2_lstm_4_while_body_86880_frozen_4394/sequential_2/lstm_4/while/lstm_cell_4/split/split_dim:output:0", "sequential_2/lstm_4/while/lstm_cell_4/BiasAdd:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/Sigmoid", "op": "Sigmoid", "input": ["sequential_2/lstm_4/while/lstm_cell_4/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/Sigmoid_1", "op": "Sigmoid", "input": ["sequential_2/lstm_4/while/lstm_cell_4/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/Relu", "op": "Relu", "input": ["sequential_2/lstm_4/while/lstm_cell_4/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/Sigmoid_2", "op": "Sigmoid", "input": ["sequential_2/lstm_4/while/lstm_cell_4/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/mul", "op": "Mul", "input": ["sequential_2/lstm_4/while/lstm_cell_4/Sigmoid_1:y:0", "sequential_2_lstm_4_while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/mul_1", "op": "Mul", "input": ["sequential_2/lstm_4/while/lstm_cell_4/Sigmoid:y:0", "sequential_2/lstm_4/while/lstm_cell_4/Relu:activations:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/add_1", "op": "AddV2", "input": ["sequential_2/lstm_4/while/lstm_cell_4/mul:z:0", "sequential_2/lstm_4/while/lstm_cell_4/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/Relu_1", "op": "Relu", "input": ["sequential_2/lstm_4/while/lstm_cell_4/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/Identity_5", "op": "Identity", "input": ["sequential_2/lstm_4/while/lstm_cell_4/add_1:z:0", "^sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/lstm_cell_4/mul_2", "op": "Mul", "input": ["sequential_2/lstm_4/while/lstm_cell_4/Sigmoid_2:y:0", "sequential_2/lstm_4/while/lstm_cell_4/Relu_1:activations:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["sequential_2_lstm_4_while_placeholder_1", "sequential_2_lstm_4_while_placeholder", "sequential_2/lstm_4/while/lstm_cell_4/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "sequential_2/lstm_4/while/Identity_4", "op": "Identity", "input": ["sequential_2/lstm_4/while/lstm_cell_4/mul_2:z:0", "^sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_4/while/Identity_3", "op": "Identity", "input": ["sequential_2/lstm_4/while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "^sequential_2/lstm_4/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}], "ret": {"sequential_2_lstm_4_while_identity_4": "sequential_2/lstm_4/while/Identity_4:output:0", "sequential_2_lstm_4_while_identity": "sequential_2/lstm_4/while/Identity:output:0", "sequential_2_lstm_4_while_lstm_cell_4_matmul_1_readvariableop_resource": "sequential_2_lstm_4_while_lstm_cell_4_matmul_1_readvariableop_resource_0", "sequential_2_lstm_4_while_identity_1": "sequential_2/lstm_4/while/Identity_1:output:0", "sequential_2_lstm_4_while_identity_5": "sequential_2/lstm_4/while/Identity_5:output:0", "sequential_2_lstm_4_while_identity_2": "sequential_2/lstm_4/while/Identity_2:output:0", "sequential_2_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_4_tensorarrayunstack_tensorlistfromtensor": "sequential_2_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_4_tensorarrayunstack_tensorlistfromtensor_0", "sequential_2_lstm_4_while_lstm_cell_4_biasadd_readvariableop_resource": "sequential_2_lstm_4_while_lstm_cell_4_biasadd_readvariableop_resource_0", "sequential_2_lstm_4_while_sequential_2_lstm_4_strided_slice_1": "sequential_2_lstm_4_while_sequential_2_lstm_4_strided_slice_1_0", "sequential_2_lstm_4_while_identity_3": "sequential_2/lstm_4/while/Identity_3:output:0", "sequential_2_lstm_4_while_lstm_cell_4_matmul_readvariableop_resource": "sequential_2_lstm_4_while_lstm_cell_4_matmul_readvariableop_resource_0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "controlRet": {"sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp": "sequential_2/lstm_4/while/lstm_cell_4/MatMul/ReadVariableOp", "sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp": "sequential_2/lstm_4/while/lstm_cell_4/BiasAdd/ReadVariableOp", "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp": "sequential_2/lstm_4/while/lstm_cell_4/MatMul_1/ReadVariableOp"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392", "inputArg": [{"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_5_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_strided_slice_1_0", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_5_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_5_while_lstm_cell_5_matmul_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_lstm_cell_5_matmul_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_lstm_cell_5_biasadd_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_2_lstm_5_while_identity", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_5_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_sequential_2_lstm_5_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_2_lstm_5_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_5_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_2_lstm_5_while_lstm_cell_5_matmul_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_lstm_cell_5_matmul_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_2_lstm_5_while_lstm_cell_5_biasadd_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_2/lstm_5/while/lstm_cell_5/BiasAdd/ReadVariableOp", "sequential_2/lstm_5/while/lstm_cell_5/MatMul/ReadVariableOp", "sequential_2/lstm_5/while/lstm_cell_5/MatMul_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/lstm_cell_5/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/MatMul/ReadVariableOp", "op": "Identity", "input": ["sequential_2_lstm_5_while_lstm_cell_5_matmul_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/MatMul_1/ReadVariableOp", "op": "Identity", "input": ["sequential_2_lstm_5_while_lstm_cell_5_matmul_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_2_lstm_5_while_lstm_cell_5_biasadd_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/add", "op": "AddV2", "input": ["sequential_2_lstm_5_while_placeholder", "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_5/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_2_lstm_5_while_tensorarrayv2read_tensorlistgetitem_sequential_2_lstm_5_tensorarrayunstack_tensorlistfromtensor_0", "sequential_2_lstm_5_while_placeholder", "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/add_1", "op": "AddV2", "input": ["sequential_2_lstm_5_while_sequential_2_lstm_5_while_loop_counter", "__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/MatMul_1", "op": "MatMul", "input": ["sequential_2_lstm_5_while_placeholder_2", "sequential_2/lstm_5/while/lstm_cell_5/MatMul_1/ReadVariableOp:output:0"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/NoOp", "op": "NoOp", "input": ["^sequential_2/lstm_5/while/lstm_cell_5/BiasAdd/ReadVariableOp", "^sequential_2/lstm_5/while/lstm_cell_5/MatMul/ReadVariableOp", "^sequential_2/lstm_5/while/lstm_cell_5/MatMul_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/MatMul", "op": "MatMul", "input": ["sequential_2/lstm_5/while/TensorArrayV2Read/TensorListGetItem:item:0", "sequential_2/lstm_5/while/lstm_cell_5/MatMul/ReadVariableOp:output:0"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/Identity_1", "op": "Identity", "input": ["sequential_2_lstm_5_while_sequential_2_lstm_5_while_maximum_iterations", "^sequential_2/lstm_5/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_5/while/Identity_2", "op": "Identity", "input": ["sequential_2/lstm_5/while/add:z:0", "^sequential_2/lstm_5/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_5/while/Identity", "op": "Identity", "input": ["sequential_2/lstm_5/while/add_1:z:0", "^sequential_2/lstm_5/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/add", "op": "AddV2", "input": ["sequential_2/lstm_5/while/lstm_cell_5/MatMul:product:0", "sequential_2/lstm_5/while/lstm_cell_5/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/BiasAdd", "op": "BiasAdd", "input": ["sequential_2/lstm_5/while/lstm_cell_5/add:z:0", "sequential_2/lstm_5/while/lstm_cell_5/BiasAdd/ReadVariableOp:output:0"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/split", "op": "Split", "input": ["__inference_sequential_2_lstm_5_while_body_87020_frozen_4392/sequential_2/lstm_5/while/lstm_cell_5/split/split_dim:output:0", "sequential_2/lstm_5/while/lstm_cell_5/BiasAdd:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/Sigmoid", "op": "Sigmoid", "input": ["sequential_2/lstm_5/while/lstm_cell_5/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/Sigmoid_1", "op": "Sigmoid", "input": ["sequential_2/lstm_5/while/lstm_cell_5/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/lstm_5/while/lstm_cell_5/Relu", "op": "Relu", "input": ["sequential_2/lstm_5/while/lstm_cell_5/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 