{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"lstm_input": {"name": "lstm_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "11"}, {"size": "1"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "11"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["lstm_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose", "op": "Transpose", "input": ["lstm_input", "StatefulPartitionedCall/sequential/lstm/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/transpose", "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape_1", "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/strided_slice_1"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/while", "op": "While", "input": ["StatefulPartitionedCall/sequential/lstm/while/loop_counter", "StatefulPartitionedCall/sequential/lstm/while/maximum_iterations", "StatefulPartitionedCall/sequential/lstm/time", "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1", "StatefulPartitionedCall/sequential/lstm/zeros", "StatefulPartitionedCall/sequential/lstm/zeros_1", "StatefulPartitionedCall/sequential/lstm/strided_slice_1", "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"body": {"func": {"name": "__inference_sequential_lstm_while_body_74824_frozen_4394"}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "cond": {"func": {"name": "__inference_sequential_lstm_while_cond_74823_frozen_4392"}}, "_num_original_outputs": {"i": "11"}, "_stateful_parallelism": {"b": false}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "1"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_lower_using_switch_merge": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/while:3", "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/transpose_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/Shape_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/Shape", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while", "op": "While", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/loop_counter", "StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations", "StatefulPartitionedCall/sequential/lstm_1/time", "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1", "StatefulPartitionedCall/sequential/lstm_1/zeros", "StatefulPartitionedCall/sequential/lstm_1/zeros_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1", "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"body": {"func": {"name": "__inference_sequential_lstm_1_while_body_74964_frozen_4393"}}, "cond": {"func": {"name": "__inference_sequential_lstm_1_while_cond_74963_frozen_4395"}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_stateful_parallelism": {"b": false}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm_1/while:3", "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_3/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice_3", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_lstm_1_while_body_74964_frozen_4393", "inputArg": [{"name": "sequential_lstm_1_while_sequential_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_strided_slice_1_0", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_lstm_1_while_lstm_cell_1_matmul_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_lstm_cell_1_matmul_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_lstm_cell_1_biasadd_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_lstm_1_while_identity", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_lstm_1_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_1_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_lstm_1_while_lstm_cell_1_matmul_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_lstm_cell_1_matmul_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_lstm_cell_1_biasadd_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential/lstm_1/while/lstm_cell_1/BiasAdd/ReadVariableOp", "sequential/lstm_1/while/lstm_cell_1/MatMul/ReadVariableOp", "sequential/lstm_1/while/lstm_cell_1/MatMul_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/MatMul/ReadVariableOp", "op": "Identity", "input": ["sequential_lstm_1_while_lstm_cell_1_matmul_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/MatMul_1/ReadVariableOp", "op": "Identity", "input": ["sequential_lstm_1_while_lstm_cell_1_matmul_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_lstm_1_while_lstm_cell_1_biasadd_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/add", "op": "AddV2", "input": ["sequential_lstm_1_while_placeholder", "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "sequential_lstm_1_while_placeholder", "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/add_1", "op": "AddV2", "input": ["sequential_lstm_1_while_sequential_lstm_1_while_loop_counter", "__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["sequential_lstm_1_while_placeholder_2", "sequential/lstm_1/while/lstm_cell_1/MatMul_1/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "sequential/lstm_1/while/NoOp", "op": "NoOp", "input": ["^sequential/lstm_1/while/lstm_cell_1/BiasAdd/ReadVariableOp", "^sequential/lstm_1/while/lstm_cell_1/MatMul/ReadVariableOp", "^sequential/lstm_1/while/lstm_cell_1/MatMul_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/MatMul", "op": "MatMul", "input": ["sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "sequential/lstm_1/while/lstm_cell_1/MatMul/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "sequential/lstm_1/while/Identity_1", "op": "Identity", "input": ["sequential_lstm_1_while_sequential_lstm_1_while_maximum_iterations", "^sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm_1/while/Identity_2", "op": "Identity", "input": ["sequential/lstm_1/while/add:z:0", "^sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm_1/while/Identity", "op": "Identity", "input": ["sequential/lstm_1/while/add_1:z:0", "^sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["sequential/lstm_1/while/lstm_cell_1/MatMul:product:0", "sequential/lstm_1/while/lstm_cell_1/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/BiasAdd", "op": "BiasAdd", "input": ["sequential/lstm_1/while/lstm_cell_1/add:z:0", "sequential/lstm_1/while/lstm_cell_1/BiasAdd/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/split", "op": "Split", "input": ["__inference_sequential_lstm_1_while_body_74964_frozen_4393/sequential/lstm_1/while/lstm_cell_1/split/split_dim:output:0", "sequential/lstm_1/while/lstm_cell_1/BiasAdd:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["sequential/lstm_1/while/lstm_cell_1/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["sequential/lstm_1/while/lstm_cell_1/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/Relu", "op": "Relu", "input": ["sequential/lstm_1/while/lstm_cell_1/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["sequential/lstm_1/while/lstm_cell_1/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["sequential/lstm_1/while/lstm_cell_1/Sigmoid_1:y:0", "sequential_lstm_1_while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["sequential/lstm_1/while/lstm_cell_1/Sigmoid:y:0", "sequential/lstm_1/while/lstm_cell_1/Relu:activations:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/add_1", "op": "AddV2", "input": ["sequential/lstm_1/while/lstm_cell_1/mul:z:0", "sequential/lstm_1/while/lstm_cell_1/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/Relu_1", "op": "Relu", "input": ["sequential/lstm_1/while/lstm_cell_1/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/Identity_5", "op": "Identity", "input": ["sequential/lstm_1/while/lstm_cell_1/add_1:z:0", "^sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["sequential/lstm_1/while/lstm_cell_1/Sigmoid_2:y:0", "sequential/lstm_1/while/lstm_cell_1/Relu_1:activations:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["sequential_lstm_1_while_placeholder_1", "sequential_lstm_1_while_placeholder", "sequential/lstm_1/while/lstm_cell_1/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "sequential/lstm_1/while/Identity_4", "op": "Identity", "input": ["sequential/lstm_1/while/lstm_cell_1/mul_2:z:0", "^sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm_1/while/Identity_3", "op": "Identity", "input": ["sequential/lstm_1/while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "^sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}], "ret": {"sequential_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_1_tensorarrayunstack_tensorlistfromtensor": "sequential_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "sequential_lstm_1_while_identity_5": "sequential/lstm_1/while/Identity_5:output:0", "sequential_lstm_1_while_identity_2": "sequential/lstm_1/while/Identity_2:output:0", "sequential_lstm_1_while_lstm_cell_1_matmul_1_readvariableop_resource": "sequential_lstm_1_while_lstm_cell_1_matmul_1_readvariableop_resource_0", "sequential_lstm_1_while_sequential_lstm_1_strided_slice_1": "sequential_lstm_1_while_sequential_lstm_1_strided_slice_1_0", "sequential_lstm_1_while_identity_1": "sequential/lstm_1/while/Identity_1:output:0", "sequential_lstm_1_while_identity_4": "sequential/lstm_1/while/Identity_4:output:0", "sequential_lstm_1_while_identity": "sequential/lstm_1/while/Identity:output:0", "sequential_lstm_1_while_lstm_cell_1_matmul_readvariableop_resource": "sequential_lstm_1_while_lstm_cell_1_matmul_readvariableop_resource_0", "sequential_lstm_1_while_identity_3": "sequential/lstm_1/while/Identity_3:output:0", "sequential_lstm_1_while_lstm_cell_1_biasadd_readvariableop_resource": "sequential_lstm_1_while_lstm_cell_1_biasadd_readvariableop_resource_0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "controlRet": {"sequential/lstm_1/while/lstm_cell_1/BiasAdd/ReadVariableOp": "sequential/lstm_1/while/lstm_cell_1/BiasAdd/ReadVariableOp", "sequential/lstm_1/while/lstm_cell_1/MatMul_1/ReadVariableOp": "sequential/lstm_1/while/lstm_cell_1/MatMul_1/ReadVariableOp", "sequential/lstm_1/while/lstm_cell_1/MatMul/ReadVariableOp": "sequential/lstm_1/while/lstm_cell_1/MatMul/ReadVariableOp"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_lstm_while_cond_74823_frozen_4392", "inputArg": [{"name": "sequential_lstm_while_sequential_lstm_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_lstm_while_sequential_lstm_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_lstm_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_lstm_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_lstm_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_less_sequential_lstm_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_lstm_while_sequential_lstm_while_cond_74823___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_lstm_while_sequential_lstm_while_cond_74823___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_sequential_lstm_while_cond_74823___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_sequential_lstm_while_cond_74823___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_lstm_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential/lstm/while/Less", "op": "Less", "input": ["sequential_lstm_while_placeholder", "sequential_lstm_while_less_sequential_lstm_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_lstm_while_identity": "sequential/lstm/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}}}, {"signature": {"name": "__inference_sequential_lstm_1_while_cond_74963_frozen_4395", "inputArg": [{"name": "sequential_lstm_1_while_sequential_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_less_sequential_lstm_1_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_while_cond_74963___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_while_cond_74963___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_while_cond_74963___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_lstm_1_while_sequential_lstm_1_while_cond_74963___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_lstm_1_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential/lstm_1/while/Less", "op": "Less", "input": ["sequential_lstm_1_while_placeholder", "sequential_lstm_1_while_less_sequential_lstm_1_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_lstm_1_while_identity": "sequential/lstm_1/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "128"}]}]}}}}}}, {"signature": {"name": "__inference_sequential_lstm_while_body_74824_frozen_4394", "inputArg": [{"name": "sequential_lstm_while_sequential_lstm_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_lstm_while_sequential_lstm_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_lstm_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_lstm_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_lstm_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_sequential_lstm_strided_slice_1_0", "type": "DT_INT32"}, {"name": "sequential_lstm_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_lstm_while_lstm_cell_matmul_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_lstm_cell_matmul_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_lstm_cell_biasadd_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_lstm_while_identity", "type": "DT_INT32"}, {"name": "sequential_lstm_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_lstm_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_lstm_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_lstm_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_sequential_lstm_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_lstm_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_lstm_while_lstm_cell_matmul_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_lstm_cell_matmul_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_lstm_while_lstm_cell_biasadd_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/lstm_cell/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "op": "Identity", "input": ["sequential_lstm_while_lstm_cell_matmul_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp", "op": "Identity", "input": ["sequential_lstm_while_lstm_cell_matmul_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_lstm_while_lstm_cell_biasadd_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/add", "op": "AddV2", "input": ["sequential_lstm_while_placeholder", "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_lstm_while_tensorarrayv2read_tensorlistgetitem_sequential_lstm_tensorarrayunstack_tensorlistfromtensor_0", "sequential_lstm_while_placeholder", "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/add_1", "op": "AddV2", "input": ["sequential_lstm_while_sequential_lstm_while_loop_counter", "__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm/while/lstm_cell/MatMul_1", "op": "MatMul", "input": ["sequential_lstm_while_placeholder_2", "sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "sequential/lstm/while/NoOp", "op": "NoOp", "input": ["^sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "^sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "^sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "sequential/lstm/while/lstm_cell/MatMul", "op": "MatMul", "input": ["sequential/lstm/while/TensorArrayV2Read/TensorListGetItem:item:0", "sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp:output:0"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/Identity_1", "op": "Identity", "input": ["sequential_lstm_while_sequential_lstm_while_maximum_iterations", "^sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm/while/Identity_2", "op": "Identity", "input": ["sequential/lstm/while/add:z:0", "^sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm/while/Identity", "op": "Identity", "input": ["sequential/lstm/while/add_1:z:0", "^sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential/lstm/while/lstm_cell/add", "op": "AddV2", "input": ["sequential/lstm/while/lstm_cell/MatMul:product:0", "sequential/lstm/while/lstm_cell/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/BiasAdd", "op": "BiasAdd", "input": ["sequential/lstm/while/lstm_cell/add:z:0", "sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp:output:0"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/split", "op": "Split", "input": ["__inference_sequential_lstm_while_body_74824_frozen_4394/sequential/lstm/while/lstm_cell/split/split_dim:output:0", "sequential/lstm/while/lstm_cell/BiasAdd:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["sequential/lstm/while/lstm_cell/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["sequential/lstm/while/lstm_cell/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/Relu", "op": "Relu", "input": ["sequential/lstm/while/lstm_cell/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["sequential/lstm/while/lstm_cell/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/mul", "op": "Mul", "input": ["sequential/lstm/while/lstm_cell/Sigmoid_1:y:0", "sequential_lstm_while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/mul_1", "op": "Mul", "input": ["sequential/lstm/while/lstm_cell/Sigmoid:y:0", "sequential/lstm/while/lstm_cell/Relu:activations:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/add_1", "op": "AddV2", "input": ["sequential/lstm/while/lstm_cell/mul:z:0", "sequential/lstm/while/lstm_cell/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/Relu_1", "op": "Relu", "input": ["sequential/lstm/while/lstm_cell/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/Identity_5", "op": "Identity", "input": ["sequential/lstm/while/lstm_cell/add_1:z:0", "^sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/lstm_cell/mul_2", "op": "Mul", "input": ["sequential/lstm/while/lstm_cell/Sigmoid_2:y:0", "sequential/lstm/while/lstm_cell/Relu_1:activations:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential/lstm/while/TensorArrayV2Write/TensorListSetItem", 